Autodesk.Revit.DB.ExportDWGSettings.GetActivePredefinedSettings(Autodesk.Revit.DB.Document)
Returns the active pre-defined non-in-session exporting settings for DWG in the given document.
aDoc:
A Revit document to retrieve the active pre-defined exporting settings for DWG.
Returns:
The active pre-defined exporting settings for DWG, or null if nothing pre-defined exists or the in-session settings is selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExportDWGSettings.ListNames(Autodesk.Revit.DB.Document)
Returns a list of names of dwg/dxf export settings.
aDoc:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns the pre-defined non-in-session exporting settings for DWG in the given document with the specified name.
aDoc:
A Revit document to retrieve the specified pre-defined exporting settings for DWG.
name:
The name of the settings to retrieve.
Returns:
The pre-defined DWG exporting settings, or null if nothing found that has the corresponding name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExportDWGSettings.SetDXFExportOptions(Autodesk.Revit.DB.DXFExportOptions)
Sets the options stored in these settings.
options:
The options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.SetDWGExportOptions(Autodesk.Revit.DB.DWGExportOptions)
Sets the options stored in these settings.
options:
The options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.DXFExportOptions)
Create a DWG export settings with default values.
document:
Document where created settings is saved.
name:
The name specified to this settings.
options:
Initialize settings by using values in DXFExportOptions.
Returns:
The new DWG export settings instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ExistOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.DWGExportOptions)
Create a DWG export settings with default values.
document:
Document where created settings is saved.
name:
The name specified to this settings.
options:
Initialize settings by using values in DWGExportOptions.
Returns:
The new DWG export settings instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ExistOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDWGSettings.Create(Autodesk.Revit.DB.Document,System.String)
Create a DWG export settings with default values.
document:
Document where created settings is saved.
name:
The name specified to this settings.
Returns:
The new DWG export settings instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ExistOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013